argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
}

/* USER CODE BEGIN 4 */

uint16_t cli_printf(const char* fmt, ...)
{
    va_list args;
    va_start(args, fmt);
    vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
    cli_write(&cli_buff[0], strlen(cli_buff));
    va_end(args);    
}

uint16_t cli_write(const char* src, uint16_t len)
{
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
}

FRESULT get_free_clusters(FATFS* fs)
{
    FRESULT fr;
    DWORD fre_clust, fre_sect, tot_sect;

    /* Get volume information and free clusters of used drive */
    fr = f_getfree((TCHAR const*)SDPath, &fre_clust, &fs);
    cli_printf("f_getfree: %d\r\n", fr);

    if (fr == FR_OK)
    {
      /* Get total sectors and free sectors */
      tot_sect = (fs->n_fatent - 2) * fs->csize;
      fre_sect = fre_clust * fs->csize;

      /* Print the free space (assuming 512 bytes/sector) */
      cli_printf("%10lu KiB total drive space.\r\n", tot_sect/2);
      cli_printf("%10lu KiB available space.\r\n", fre_sect/2);
    }
    
    return fr;
}

/* Start node to be scanned (***also used as work area***) */
FRESULT scan_files(char* path)
{
    FRESULT res;
    DIR dir;
    UINT i;
    static FILINFO fno;

    res = f_opendir(&dir, path);                       /* Open the directory */
    if (res == FR_OK) {
        for (;;) {
            res = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (res != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "/%s", fno.fname);
                res = scan_files(path);                    /* Enter the directory */
                if (res != FR_OK) break;
                path[i] = 0;
            }
            else 
            {                                       /* It is a file. */
                cli_printf("%s/%s\r\n", path, fno.fname);
            }
        }
        f_closedir(&dir);
    }

    return res;
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for FATFS */
  MX_FATFS_Init();

/* Graphic application */  
  GRAPHICS_MainTask();

  /* USER CODE BEGIN 5 */
    /* Infinite loop */
    for (;;)
    {
        osDelay(1);
    }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartButtonTask */
/**
* @brief Function implementing the buttonTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartButtonTask */
void StartButtonTask(void const * argument)
{
  /* USER CODE BEGIN StartButtonTask */
  uint32_t buttonState = 0;
  
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
  
  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      if(xQueueSend(buttonQueueHandle, (uint8_t*)&buttonState, 0) == pdTRUE)
      {
        cli_printf("[Queue] HW -> Model (%d)\r\n", buttonState);
      }
    }
    
    osDelay(100);
  }
  /* USER CODE END StartButtonTask */
}

/* USER CODE BEGIN Header_StartLEDTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLEDTask */
void StartLEDTask(void const * argument)
{
  /* USER CODE BEGIN StartLEDTask */
  
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);
      
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
      
      cli_printf("[Queue] Model -> HW (%d)\r\n", led_state);
    }
    
    osDelay(20);
  }
  /* USER CODE END StartLEDTask */
}

/* USER CODE BEGIN Header_StartSDTask */
/**
* @brief Function implementing the sdTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{
  /* USER CODE BEGIN StartSDTask */
  FRESULT fr;                                           /* FatFs function common result code */
  uint32_t byteswritten, bytesread;                     /* File write/read counts */
  uint8_t wtext[] = "This is STM32 working with FatFs"; /* File write buffer */
  uint8_t rtext[100];                                   /* File read buffer */
    
  cli_printf("FATFS %s\r\n", "Start");
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  // if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {  
    /*##-2- Register the file system object to the FatFs module ##############*/
    fr = f_mount(&SDFatFs, (TCHAR const*)SDPath, 0);
    cli_printf("f_mount: %d\r\n", fr);
    if(fr != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
#if 1      
      fr = get_free_clusters(&SDFatFs);
#else
      /*##-3- Create a FAT file system (format) on the logical drive #########*/
      /* WARNING: Formatting the uSD card will delete all content on the device */
      fr = f_mkfs((TCHAR const*)SDPath, FM_ANY, 0, workBuffer, sizeof(workBuffer));
      cli_printf("f_mkfs: %d\r\n", fr);
#endif
      if(fr != FR_OK)
      {
        /* FatFs Format Error */
        Error_Handler();
      }
      else
      {
        /*##-4- Create and Open a new text file object with write access #####*/
        fr = f_open(&MyFile, "STM32.TXT", FA_CREATE_ALWAYS | FA_WRITE);
        cli_printf("f_open: %d\r\n", fr);
        if(fr != FR_OK)
        {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
        }
        else
        {
          /*##-5- Write data to the text file ################################*/
          fr = f_write(&MyFile, wtext, sizeof(wtext), (UINT *)&byteswritten);
          cli_printf("f_write: %d\r\n", fr);
          if((byteswritten == 0) || (fr != FR_OK))
          {
            /* 'STM32.TXT' file Write or EOF Error */
            Error_Handler();
          }
          else
          {
            /*##-6- Close the open text file #################################*/
            fr = f_close(&MyFile);
            cli_printf("f_close: %d\r\n", fr);
            
