argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
            /*##-7- Open the text file object with read access ###############*/
            fr = f_open(&MyFile, "STM32.TXT", FA_READ);
            cli_printf("f_open: %d\r\n", fr);
            if(fr != FR_OK)
            {
              /* 'STM32.TXT' file Open for read Error */
              Error_Handler();
            }
            else
            {
              /*##-8- Read data from the text file ###########################*/
              fr = f_read(&MyFile, rtext, sizeof(rtext), (UINT*)&bytesread);
              cli_printf("f_read: %d\r\n", fr);
              if((bytesread == 0) || (fr != FR_OK))
              {
                /* 'STM32.TXT' file Read or EOF Error */
                Error_Handler();
              }
              else
              {
                /*##-9- Close the open text file #############################*/
                fr = f_close(&MyFile);
                cli_printf("f_close: %d\r\n", fr);
                
                /*##-10- Compare read data with the expected data ############*/
                if ((bytesread != byteswritten))
                {                
                  /* Read data is different from the expected data */
                  Error_Handler();
                }
                else
                {
                    cli_printf("FATFS %s\r\n", "Success");
                }
              }
            }
          }
        }
      }
      
      /*##-10++ - Scan files in the device ###############################*/
      strcpy((char*)rtext, "/");
      rtext[2] = 0x00;
      fr = scan_files((char*)rtext);
      cli_printf("scan_files: %d\r\n", fr);
    }
  }

  /*##-11- Unlink the micro SD disk I/O driver ###############################*/
  cli_printf("FATFS %s\r\n", "End");
  FATFS_UnLinkDriver(SDPath);
  
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END StartSDTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
